CSI API ETABS v1

# cFunctionFuncTH Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cFunctionTH FuncTH { get; }

    ReadOnly Property FuncTH As cFunctionTH
    	Get

    Dim instance As cFunction
    Dim value As cFunctionTH

    value = instance.FuncTH

    property cFunctionTH^ FuncTH {
    	cFunctionTH^ get ();
    }

    abstract FuncTH : cFunctionTH with get

#### Property Value

Type: cFunctionTH

See Also

#### Reference

cFunction Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com